#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "vegero-example-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For General Purposes"
          + "Environment"      = "Development"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "Container Registry"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + registry_id = (known after apply)
  + repo_name   = "vegero-example-ecr"
  + repo_url    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

Results for commit: d9345800bc05277fdb862ea4bbacf6b74f63e402

*Pusher: @vvvegero97, Action: `pull_request`, Working Directory: `eu-north-1/K8S/ecr`, Workflow: `Terraform CI/CD`*